app/views/pages/welcome.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---

          <td><%= gossip.user.first_name %></td>