app/controllers/pages_controller.rb

    def welcome
        @name = params[:first_name]
        @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

    def show

        @gossips = Gossip.all
        @id_gossips = Gossip.find(params['id'])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]

    def user

        @users = User.all
        @id_users = User.find(params['id'])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]